# Впишите в этой функции код вашего решения
# На вход подаётся уже готовый список курсов, где каждый курс — это словарь с ключами title, mentors, duration
def check_corr(courses_list:list) -> tuple:
    # Если между курсами есть связь, то при сортировке их как по количеству преподавателей, так и по длительности курса
    # порядок курсов должен оказаться одинаковым. Порядковый номер курса — это его индекс, поэтому нам нужно сделать два списка,
    # хранящих индексы курсов. первая пара будет (duration, idx), вторая пара будет (mentors_count, idx)
    duration_index = [] # список кортежей вида [(duration, idx), ...]
    mcount_index = [] # список кортежей вида [(mentors_count, idx), ...]

    # Заполните пары списков. Для получения индекса используйте enumerate()
    # Помните, что enumerate() возвращает пары (индекс_элемента_в_списке, элемент) для каждого элемента списка
    for idx, course in enumerate(courses_list):
        duration_index.append((course['duration'], idx))  # Заполните список duration_index с парами длительность-индекс
        mcount_index.append((len(course['mentors']), idx))  # Заполните список mcount_index с парами количество преподавателей-индекс. Обратите внимание, что здесь нам нужно именно количество преподавателей, а не сами имена! Подумайте, как это реализовать

    # Отсортируйте списки duration_index и mcount_index при помощи sort(). Функция sort() сортирует по первому элементу каждого внутреннего списка,
    # поэтому в результате получится сортировка по длительности или по количеству преподавателей, а id перемешаются — что нам и нужно
    duration_index.sort()
    mcount_index.sort()

    # Отделите уже отсортированные индексы от значений
    indexes_d = [] # индексы, связанные с длительностями курсов
    indexes_m = [] # индексы, связанные с количеством преподавателей
    for item in duration_index:  # В цикле пройдите по элементам списка duration_index
        indexes_d.append(item[1])  # Добавьте второй элемент пары длительность-индекс в список indexes_d
    for item in mcount_index:  # В цикле пройдите элементам списка mcount_index
        indexes_m.append(item[1])  # Добавьте второй элемент пары количество преподавателей-индекс в список indexes_m

    # В переменную has_corr необходимо присвоить значение типа bool, означающее, совпадают ли списки индексов или нет
    has_corr = indexes_d == indexes_m  # Напишите такое выражение, чтобы переменной has_corr присваивалось True, если индексы идут в одинаковом порядке, или False, если порядок разный
    result = has_corr, indexes_d, indexes_m  # Сформируйте результат из трёх значений: признак связи (bool), список индексов курсов по длительностям, список индексов курсов по количеству преподавателей
    return result  # Не изменяйте этот код

# Список курсов и параллельный список преподавателей
courses = ["Java-разработчик с нуля", "Fullstack-разработчик на Python", "Python-разработчик с нуля", "Frontend-разработчик с нуля"]
mentors = [
	["Филипп Воронов", "Анна Юшина", "Иван Бочаров", "Анатолий Корсаков", "Юрий Пеньков", "Илья Сухачев", "Иван Маркитан", "Ринат Бибиков", "Вадим Ерошевичев", "Тимур Сейсембаев", "Максим Батырев", "Никита Шумский", "Алексей Степанов", "Денис Коротков", "Антон Глушков", "Сергей Индюков", "Максим Воронцов", "Евгений Грязнов", "Константин Виролайнен", "Сергей Сердюк", "Павел Дерендяев"],
	["Евгений Шмаргунов", "Олег Булыгин", "Александр Бардин", "Александр Иванов", "Кирилл Табельский", "Александр Ульянцев", "Роман Гордиенко", "Адилет Асканжоев", "Александр Шлейко", "Алена Батицкая", "Денис Ежков", "Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Максим Филипенко", "Елена Никитина"],
	["Евгений Шмаргунов", "Олег Булыгин", "Дмитрий Демидов", "Кирилл Табельский", "Александр Ульянцев", "Александр Бардин", "Александр Иванов", "Антон Солонилин", "Максим Филипенко", "Елена Никитина", "Азамат Искаков"],
	["Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Валерий Хаслер", "Татьяна Тен", "Александр Фитискин", "Александр Шлейко", "Алена Батицкая", "Александр Беспоясов", "Денис Ежков", "Николай Лопин", "Михаил Ларченко"]
]
durations = [14, 20, 12, 20] # Длительности курсов, при которых связи не будет
# durations = [21, 16, 11, 12] # Длительности курсов, при которых есть связь
courses_list = [] # Не изменяйте этот код, список курсов должен оставаться пустым!

# Не изменяйте этот код
if __name__ == '__main__':
    # Создаём список курсов (каждый курс - словарь с ключами title и mentors)
    courses_list = []
    for course, mentor, duration in zip(courses, mentors, durations):
        course_dict = {"title":course, "mentors":mentor, "duration":duration}
        courses_list.append(course_dict)
