# подсчитайте количество рабочего времени, указанного в переменной todo_list.
# значение в переменной workday изменять не нужно.

def count_worktime(todo_list: list, workday: float = 8) -> float:
    worktime = 0.0
    a=1
    for i in range(len(todo_list)): # посчитайте в цикле сумму рабочего времени и сохраните в переменную worktime
        worktime+=todo_list[i][a]
    result =round(workday-worktime,1) # подсчитайте время, оставшееся на перерывы
    return result # не изменяйте этот код

# список с задачами. вы должны подсчитать их общую длительность
# попробуйте менять значения и добавлять новые задачи в список
todo_list = [
        ["Разобрать почту", 1],
        ["Обзвонить клиентов", 2],
        ["Запланировать дела на завтра", 0.6],
        ["Сделать презентацию", 3],
        ["Созвон с командой", 0.4]
    ]

